Revit 2024 API
Document.NewAreaBoundaryConditions Method (Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
 Creates a new Area BoundaryConditions element on a host element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public BoundaryConditions NewAreaBoundaryConditions(
	Element hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
Visual Basic
Public Function NewAreaBoundaryConditions ( _
	hostElement As Element, _
	X_Translation As TranslationRotationValue, _
	X_TranslationSpringModulus As Double, _
	Y_Translation As TranslationRotationValue, _
	Y_TranslationSpringModulus As Double, _
	Z_Translation As TranslationRotationValue, _
	Z_TranslationSpringModulus As Double _
) As BoundaryConditions
Visual C++
public:
BoundaryConditions^ NewAreaBoundaryConditions(
	Element^ hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
Parameters
hostElement
Type: Autodesk.Revit.DB.Element
 A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation
Type: Autodesk.Revit.DB.Structure.TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus
Type: System.Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation
Type: Autodesk.Revit.DB.Structure.TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus
Type: System.Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation
Type: Autodesk.Revit.DB.Structure.TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus
Type: System.Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Return Value
If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Remarks
This method will only function with the Autodesk Revit Structure application.
Examples
CopyC#
bool CreateAreaConditionWithElement(AnalyticalPanel wall, Autodesk.Revit.Creation.Document docCreation)
{
   // Create Area Boundary Conditions using a given Wall and defaulting to fixed in all directions
   BoundaryConditions condition = docCreation.NewAreaBoundaryConditions(wall, TranslationRotationValue.Fixed, 0,
                                                                              TranslationRotationValue.Fixed, 0,
                                                                              TranslationRotationValue.Fixed, 0);
   return (null != condition);
}
CopyVB.NET
Private Function CreateAreaConditionWithElement(wall As Wall, docCreation As Autodesk.Revit.Creation.Document) As Boolean
    ' Create Area Boundary Conditions using a given Wall and defaulting to fixed in all directions
    Dim condition As BoundaryConditions = docCreation.NewAreaBoundaryConditions(wall, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, _
        0)
    Return (condition IsNot Nothing)
End Function
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the host element does not exist in the given document.
See Also
Document Class
NewAreaBoundaryConditions Overload
Autodesk.Revit.Creation Namespace